{"modelTopology": {"training_config": {"sample_weight_mode": null, "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "learning_rate": 0.0010000000474974513, "name": "Adam", "decay": 0.0, "amsgrad": false, "epsilon": 1e-07}}, "loss_weights": null, "weighted_metrics": null, "metrics": ["accuracy"], "loss": "sparse_categorical_crossentropy"}, "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "Embedding", "config": {"embeddings_regularizer": null, "name": "embedding", "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "dtype": "float32", "trainable": true, "activity_regularizer": null, "embeddings_constraint": null, "batch_input_shape": [null, null], "output_dim": 64, "input_length": null, "input_dim": 10000, "mask_zero": false}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional", "dtype": "float32", "trainable": true, "layer": {"class_name": "LSTM", "config": {"implementation": 2, "bias_regularizer": null, "time_major": false, "dtype": "float32", "name": "lstm", "recurrent_dropout": 0.0, "recurrent_regularizer": null, "activity_regularizer": null, "return_state": false, "dropout": 0.0, "unit_forget_bias": true, "recurrent_constraint": null, "units": 64, "stateful": false, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": false, "trainable": true, "go_backwards": false, "kernel_regularizer": null, "unroll": false, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_activation": "sigmoid", "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, "merge_mode": "concat"}}, {"class_name": "Dense", "config": {"units": 64, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense", "dtype": "float32", "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}, {"class_name": "Dense", "config": {"units": 6, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "dtype": "float32", "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}], "name": "sequential"}}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}, "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.5.2", "format": "layers-model", "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional/forward_lstm/kernel", "dtype": "float32", "shape": [64, 256]}, {"name": "bidirectional/forward_lstm/recurrent_kernel", "dtype": "float32", "shape": [64, 256]}, {"name": "bidirectional/forward_lstm/bias", "dtype": "float32", "shape": [256]}, {"name": "bidirectional/backward_lstm/kernel", "dtype": "float32", "shape": [64, 256]}, {"name": "bidirectional/backward_lstm/recurrent_kernel", "dtype": "float32", "shape": [64, 256]}, {"name": "bidirectional/backward_lstm/bias", "dtype": "float32", "shape": [256]}, {"name": "dense/kernel", "dtype": "float32", "shape": [128, 64]}, {"name": "dense/bias", "dtype": "float32", "shape": [64]}, {"name": "dense_1/kernel", "dtype": "float32", "shape": [64, 6]}, {"name": "dense_1/bias", "dtype": "float32", "shape": [6]}, {"name": "embedding/embeddings", "dtype": "float32", "shape": [10000, 64]}]}]}